In [1]:
import pandas as pd
import numpy as np

### df.where -
    Replace value where condition is false  
### df.mask - 
    Replace value where condition is true

In [2]:
dummy_data = pd.DataFrame(
    np.array([[1, 2, 3], [4, 5, np.nan], [7, 8, 9], [3, 2, np.nan], [5, 6, np.nan]]), 
    columns=['Column 1', 'Column 2', 'Column 3'])

In [3]:
dummy_data

   Column 1  Column 2  Column 3
0       1.0       2.0       3.0
1       4.0       5.0       NaN
2       7.0       8.0       9.0
3       3.0       2.0       NaN
4       5.0       6.0       NaN

In [4]:
dummy_data.where(dummy_data['Column 3'].isnull(),np.nan)

   Column 1  Column 2  Column 3
0       NaN       NaN       NaN
1       4.0       5.0       NaN
2       NaN       NaN       NaN
3       3.0       2.0       NaN
4       5.0       6.0       NaN

In [5]:
dummy_data.mask(dummy_data['Column 3'].isnull(),0)

   Column 1  Column 2  Column 3
0       1.0       2.0       3.0
1       0.0       0.0       0.0
2       7.0       8.0       9.0
3       0.0       0.0       0.0
4       0.0       0.0       0.0

In [6]:
list(zip(dummy_data['Column 3'],dummy_data['Column 3'].mask(dummy_data['Column 3'].isnull(),0)))

[(3.0, 3.0), (nan, 0.0), (9.0, 9.0), (nan, 0.0), (nan, 0.0)]

In [7]:
list(zip(dummy_data['Column 3'],dummy_data['Column 3'].where(dummy_data['Column 3'].isnull(),np.nan)))

[(3.0, nan), (nan, nan), (9.0, nan), (nan, nan), (nan, nan)]